nrfconnect/sdk-nrf/samples/wifi/radio_test/common/src/nrf_wifi_radio_test_shell_nrf71.c
	ctx->conf_params.lna_gain = val;

	return 0;
}


static int nrf_wifi_radio_test_set_rx_bb_gain(const struct shell *shell,
					      size_t argc,
					      const char *argv[])
{
	char *ptr = NULL;
	signed char val = 0;

	val = strtoul(argv[1], &ptr, 10);

	if ((val > 31) || (val < 0)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "'bb_gain' has to be in between 0 to 31\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.bb_gain = val;

	return 0;
}


static int nrf_wifi_radio_test_set_rx_capture_length(const struct shell *shell,
						     size_t argc,
						     const char *argv[])
{
	char *ptr = NULL;
	unsigned short int val = 0;

	val = strtoul(argv[1], &ptr, 10);

	if ((val > NRF_WIFI_RF_TEST_RX_CAPTURE_MAX_SAMPLES) ||
	    (val < MIN_CAPTURE_LEN)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "'capture_length' has to be non-zero and less than %d\n",
			      NRF_WIFI_RF_TEST_RX_CAPTURE_MAX_SAMPLES);
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.capture_length = val;

	return 0;
}

static int nrf_wifi_radio_test_set_rx_capture_timeout(const struct shell *shell, size_t argc,
						      const char *argv[])
{
	char *ptr = NULL;
	unsigned short int val = 0;

	val = strtoul(argv[1], &ptr, 10);

	if (val > CAPTURE_DURATION_IN_SEC) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "'capture_timeout' has to be less than 600 seconds\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.capture_timeout = val;

	return 0;
}

static int nrf_wifi_radio_test_set_rx_capture_ed_thresh(const struct shell *shell,
							size_t argc,
							const char *argv[])
{
	char *ptr = NULL;
	long ofdm = 0;
	long dsss = 0;

	ofdm = strtol(argv[1], &ptr, 10);
	if (ofdm < -100 || ofdm > 0) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "'ed_thresh_ofdm' must be in -100..0\n");
		return -ENOEXEC;
	}

	dsss = strtol(argv[2], &ptr, 10);
	if (dsss < -100 || dsss > 0) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "'ed_thresh_dsss' must be in -100..0\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.ed_thresh_ofdm = (unsigned char)((signed char)ofdm);
	ctx->conf_params.ed_thresh_dsss = (unsigned char)((signed char)dsss);

	return 0;
}

static int nrf_wifi_radio_test_set_ru_tone(const struct shell *shell,
					   size_t argc,
					   const char *argv[])
{
	char *ptr = NULL;
	unsigned long val = 0;

	val = strtoul(argv[1], &ptr, 10);

	if ((val != 26) &&
	    (val != 52) &&
	    (val != 106) &&
	    (val != 242)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid value %lu\n",
			      val);
		shell_help(shell);
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.ru_tone = val;

	return 0;
}


static int nrf_wifi_radio_test_set_ru_index(const struct shell *shell,
					    size_t argc,
					    const char *argv[])
{
	char *ptr = NULL;
	unsigned long val = 0;

	val = strtoul(argv[1], &ptr, 10);

	if (ctx->conf_params.ru_tone == 26) {
		if ((val < 1) || (val > 9)) {
			shell_fprintf(shell,
				      SHELL_ERROR,
				      "Invalid value %lu\n",
				      val);
			shell_help(shell);
			return -ENOEXEC;
		}
	} else if (ctx->conf_params.ru_tone == 52) {
		if ((val < 1) || (val > 4)) {
			shell_fprintf(shell,
				      SHELL_ERROR,
				      "Invalid value %lu\n",
				      val);
			shell_help(shell);
			return -ENOEXEC;
		}
	} else if (ctx->conf_params.ru_tone == 106) {
		if ((val < 1) || (val > 2)) {
			shell_fprintf(shell,
				      SHELL_ERROR,
				      "Invalid value %lu\n",
				      val);
			shell_help(shell);
			return -ENOEXEC;
		}
	} else if (ctx->conf_params.ru_tone == 242) {
		if ((val != 1)) {
			shell_fprintf(shell,
				      SHELL_ERROR,
				      "Invalid value %lu\n",
				      val);
			shell_help(shell);
			return -ENOEXEC;
		}
	} else {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "RU tone not set\n");
		shell_help(shell);
		return -ENOEXEC;
	}


	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.ru_index = val;

	return 0;
}


static int nrf_wifi_radio_test_init(const struct shell *shell,
				    size_t argc,
				    const char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	char *ptr = NULL;
	unsigned long band, chan_num = 0;

	band = strtoul(argv[1], &ptr, 10);
	chan_num = strtoul(argv[2], &ptr, 10);

	switch (band) {
	case NRF_WIFI_FREQ_BAND_2_4_GHZ:
		if (!check_valid_chan_2g(chan_num)) {
			shell_fprintf(shell,
				      SHELL_ERROR,
				      "Invalid channel number %lu on 2G band\n",
				      chan_num);
			return -ENOEXEC;
		}
	break;
	case NRF_WIFI_FREQ_BAND_5_GHZ:
		if (!check_valid_chan_5g(chan_num)) {
			shell_fprintf(shell,
				      SHELL_ERROR,
				      "Invalid channel number %lu on 5G band\n",
				      chan_num);
			return -ENOEXEC;
		}
	break;
	case NRF_WIFI_FREQ_BAND_6_GHZ:
		if (!check_valid_chan_6g(chan_num)) {
			shell_fprintf(shell,
				      SHELL_ERROR,
				      "Invalid channel number %lu on 6G band\n",
				      chan_num);
			return -ENOEXEC;
		}
	break;
	default:
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid band %lu\n",
			      band);
		return -ENOEXEC;
	}

	if (ctx->conf_params.rx) {
		shell_fprintf(shell,
			      SHELL_INFO,
			      "Disabling ongoing RX test\n");

		ctx->conf_params.rx = 0;

		status = nrf_wifi_rt_fmac_prog_rx(ctx->rpu_ctx,
							  &ctx->conf_params);

		if (status != NRF_WIFI_STATUS_SUCCESS) {
			shell_fprintf(shell,
				      SHELL_ERROR,
				      "Disabling RX failed\n");
			return -ENOEXEC;
		}
	}

	if (ctx->conf_params.tx) {
		shell_fprintf(shell,
			      SHELL_INFO,
			      "Disabling ongoing TX test\n");

		ctx->conf_params.tx = 0;

		status = nrf_wifi_rt_fmac_prog_tx(ctx->rpu_ctx,
							  &ctx->conf_params);

		if (status != NRF_WIFI_STATUS_SUCCESS) {
			shell_fprintf(shell,
				      SHELL_ERROR,
				      "Disabling TX failed\n");
			return -ENOEXEC;
		}
	}

	if (ctx->rf_test_run) {
		if (ctx->rf_test != NRF_WIFI_RF_TEST_TX_TONE) {
			shell_fprintf(shell,
				      SHELL_ERROR,
				      "Unexpected: RF Test (%d) running\n",
				      ctx->rf_test);

			return -ENOEXEC;
		}

