nrfconnect/sdk-nrf/samples/wifi/radio_test/common/src/nrf_wifi_radio_test_shell_nrf71.c
			shell_fprintf(shell,
				      SHELL_INFO,
				      "\n");
		}
	} else if (capture_status == 1) {
		shell_fprintf(shell,
			      SHELL_INFO,
			      "\n************* Capture failed ***********\n");
	} else {
		shell_fprintf(shell,
			      SHELL_INFO,
			      "\n************* Packet detection failed ***********\n");
	}

	ret = 0;
out:
	if (rx_cap_buf) {
		k_free(rx_cap_buf);
	}
	ctx->rf_test_run = false;
	ctx->rf_test = NRF_WIFI_RF_TEST_MAX;

	return ret;
}


static int nrf_wifi_radio_test_tx_tone(const struct shell *shell,
				       size_t argc,
				       const char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	char *ptr = NULL;
	unsigned long val = 0;
	int ret = -ENOEXEC;

	val = strtoul(argv[1], &ptr, 10);

	if (val > 1) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid value %lu\n",
			      val);
		shell_help(shell);
		goto out;

	}

	if (val == 1) {
		if (!check_test_in_prog(shell)) {
			goto out;
		}

	}

	status = nrf_wifi_rt_fmac_rf_test_tx_tone(ctx->rpu_ctx,
					       (unsigned char)val,
					       ctx->conf_params.tx_tone_freq,
					       ctx->conf_params.tx_power,
					       ctx->conf_params.tx_tone_type,
					       ctx->conf_params.tx_tone_dc_offset_i,
					       ctx->conf_params.tx_tone_dc_offset_q);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "TX tone programming failed\n");
		goto out;
	}

	if (val == 1) {
		ctx->rf_test_run = true;
		ctx->rf_test = NRF_WIFI_RF_TEST_TX_TONE;
	} else {
		ctx->rf_test_run = false;
		ctx->rf_test = NRF_WIFI_RF_TEST_MAX;
	}

	ret = 0;
out:
	return ret;
}


static int nrf_wifi_radio_comp_opt_xo_val(const struct shell *shell,
					  size_t argc,
					  const char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;

	int ret = -ENOEXEC;

	if (!check_test_in_prog(shell)) {
		goto out;
	}

	ctx->rf_test_run = true;
	ctx->rf_test = NRF_WIFI_RF_TEST_XO_TUNE;

	status = nrf_wifi_rt_fmac_rf_test_compute_xo(ctx->rpu_ctx);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "XO value computation failed\n");
		goto out;
	}

	ret = 0;
out:
	ctx->rf_test_run = false;
	ctx->rf_test = NRF_WIFI_RF_TEST_MAX;

	return ret;
}

static int nrf_wifi_radio_test_set_rx_bss_color(const struct shell *shell,
						size_t argc,
						const char *argv[])
{
	char *ptr = NULL;
	unsigned long rx_bss_color = 0;

	rx_bss_color = strtoul(argv[1], &ptr, 10);

	if ((rx_bss_color < 0) || (rx_bss_color > 63)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid rx bss color setting\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.rx_bss_color = rx_bss_color;

	return 0;
}

static int nrf_wifi_radio_test_set_rx_station_id(const struct shell *shell,
						 size_t argc,
						 const char *argv[])
{
	char *ptr = NULL;
	unsigned long rx_station_id = 0;

	rx_station_id = strtoul(argv[1], &ptr, 10);

	if ((rx_station_id < 0) || (rx_station_id > 63)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid rx station id setting\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.rx_station_id = rx_station_id;

	return 0;
}

static int nrf_wifi_radio_test_set_rx_bss_check(const struct shell *shell,
						size_t argc,
						const char *argv[])
{
	char *ptr = NULL;
	unsigned long rx_bss_check = 0;

	rx_bss_check = strtoul(argv[1], &ptr, 10);

	if ((rx_bss_check < 0) || (rx_bss_check > 1)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid rx bss check setting\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.bss_check_enable = rx_bss_check;

	return 0;
}

static int nrf_wifi_radio_test_set_tx_dcm(const struct shell *shell,
					  size_t argc,
					  const char *argv[])
{
	char *ptr = NULL;
	unsigned long tx_dcm = 0;

	tx_dcm = strtoul(argv[1], &ptr, 10);

	if ((tx_dcm < 0) || (tx_dcm > 2)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid tx dcm setting\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.tx_dcm = tx_dcm;

	return 0;
}

static int nrf_wifi_radio_test_set_tx_doppler(const struct shell *shell,
					      size_t argc,
					      const char *argv[])
{
	char *ptr = NULL;
	unsigned long tx_doppler = 0;

	tx_doppler = strtoul(argv[1], &ptr, 10);

	if ((tx_doppler < 0) || (tx_doppler > 1)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid tx doppler setting\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.tx_doppler = tx_doppler;

	return 0;
}

static int nrf_wifi_radio_test_set_tx_midample_periodicity(const struct shell *shell,
							   size_t argc,
							   const char *argv[])
{
	char *ptr = NULL;
	unsigned long tx_midample_periodicity = 0;

	tx_midample_periodicity = strtoul(argv[1], &ptr, 10);

	if ((tx_midample_periodicity != 10) && (tx_midample_periodicity != 20)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid tx midample periodicity setting\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.tx_midamble_periodicity = tx_midample_periodicity;

	return 0;
}

static int nrf_wifi_radio_test_set_tx_106_tone(const struct shell *shell,
					       size_t argc,
					       const char *argv[])
{
	char *ptr = NULL;
	unsigned long tx_106_tone = 0;

	tx_106_tone = strtoul(argv[1], &ptr, 10);

	if ((tx_106_tone < 0) || (tx_106_tone > 2)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid tx 106 tone setting\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.tx_106_tone = tx_106_tone;

	return 0;
}

static int nrf_wifi_radio_test_set_tx_legacy_length(const struct shell *shell,
						    size_t argc,
						    const char *argv[])
{
	char *ptr = NULL;
	unsigned long tx_legacy_length = 0;

	tx_legacy_length = strtoul(argv[1], &ptr, 10);

