nrfconnect/sdk-nrf/samples/wifi/radio_test/common/src/nrf_wifi_radio_test_shell_nrf71.c
	if ((tx_legacy_length < 0) || (tx_legacy_length > 4096)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid tx legacy length setting\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.tx_legacy_length = tx_legacy_length;

	return 0;
}

static int nrf_wifi_radio_test_set_tx_fec_padd_factor(const struct shell *shell,
						      size_t argc,
						      const char *argv[])
{
	char *ptr = NULL;
	unsigned long tx_fec_padd_factor = 0;

	tx_fec_padd_factor = strtoul(argv[1], &ptr, 10);

	if ((tx_fec_padd_factor < 0) || (tx_fec_padd_factor > 4)) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid tx fec padding factor setting\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.tx_fec_padd_factor = tx_fec_padd_factor;

	return 0;
}

static int nrf_wifi_radio_test_set_tx_num_he_ltf(const struct shell *shell,
						 size_t argc,
						 const char *argv[])
{
	char *ptr = NULL;
	unsigned long tx_num_he_ltf = 0;

	tx_num_he_ltf = strtoul(argv[1], &ptr, 10);

	/*
	 * Valid encoding for NUM-HE-LTF (802.11ax, Table 27-20):
	 * 0 -> 1 HE-LTF symbol
	 * 1 -> 2 HE-LTF symbols
	 * 2 -> 4 HE-LTF symbols
	 * 3 -> 6 HE-LTF symbols
	 * 4 -> 8 HE-LTF symbols
	 * Other values are reserved
	 */
	if (tx_num_he_ltf > 4) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid tx_num_he_ltf value "
			      "(0=1LTF, 1=2LTF, 2=4LTF, 3=6LTF, 4=8LTF)\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.he_ltf =
		(unsigned char)tx_num_he_ltf;

	return 0;
}

static int nrf_wifi_radio_test_set_tx_fec_coding(const struct shell *shell,
						 size_t argc,
						 const char *argv[])
{
	char *ptr = NULL;
	unsigned long tx_fec_coding = 0;

	tx_fec_coding = strtoul(argv[1], &ptr, 10);

	/*
	 * FEC coding:
	 * 0 -> BCC
	 * 1 -> LDPC
	 */
	if (tx_fec_coding > 1) {
		shell_fprintf(shell,
			      SHELL_ERROR,
			      "Invalid FEC coding value "
			      "(0=BCC, 1=LDPC)\n");
		return -ENOEXEC;
	}

	if (!check_test_in_prog(shell)) {
		return -ENOEXEC;
	}

	ctx->conf_params.tx_pkt_fec_coding =
		(unsigned char)tx_fec_coding;

	return 0;
}


static int nrf_wifi_radio_test_show_cfg(const struct shell *shell,
					size_t argc,
					const char *argv[])
{
	struct rpu_conf_params *conf_params = NULL;

	conf_params = &ctx->conf_params;

	shell_fprintf(shell,
		      SHELL_INFO,
		      "************* Configured Parameters ***********\n");
	shell_fprintf(shell,
		      SHELL_INFO,
		      "\n");

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_pkt_tput_mode = %d\n",
		      conf_params->tx_pkt_tput_mode);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_pkt_sgi = %d\n",
		      conf_params->tx_pkt_sgi);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_pkt_preamble = %d\n",
		      conf_params->tx_pkt_preamble);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_pkt_mcs = %d\n",
		      conf_params->tx_pkt_mcs);

	if (conf_params->tx_pkt_rate == 5)
		shell_fprintf(shell,
			      SHELL_INFO,
			      "tx_pkt_rate = 5.5\n");
	else
		shell_fprintf(shell,
			      SHELL_INFO,
			      "tx_pkt_rate = %d\n",
			      conf_params->tx_pkt_rate);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_pkt_gap = %d\n",
		      conf_params->tx_pkt_gap_us);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_pkt_num = %d\n",
		      conf_params->tx_pkt_num);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_pkt_len = %d\n",
		      conf_params->tx_pkt_len);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_power = %d\n",
		      conf_params->tx_power);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "he_ltf = %d\n",
		      conf_params->he_ltf);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "he_gi = %d\n",
		      conf_params->he_gi);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "init = %d\n",
		      conf_params->chan.primary_num);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx = %d\n",
		      conf_params->tx);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "rx = %d\n",
		      conf_params->rx);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_tone_freq = %d\n",
		      conf_params->tx_tone_freq);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_tone_type = %d\n",
		      conf_params->tx_tone_type);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_tone_dc_offset_i = %d\n",
		      conf_params->tx_tone_dc_offset_i);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_tone_dc_offset_q = %d\n",
		      conf_params->tx_tone_dc_offset_q);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "rx_lna_gain = %d\n",
		      conf_params->lna_gain);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "rx_bb_gain = %d\n",
		      conf_params->bb_gain);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "rx_capture_length = %d\n",
		      conf_params->capture_length);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "rx_capture_timeout = %d\n",
		      conf_params->capture_timeout);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "ed_thresh_ofdm = %d\n",
		      conf_params->ed_thresh_ofdm);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "ed_thresh_dsss = %d\n",
		      conf_params->ed_thresh_dsss);

#if defined(CONFIG_BOARD_NRF7002DK_NRF5340_CPUAPP_NRF7001) || \
	defined(CONFIG_BOARD_NRF7002DK_NRF5340_CPUAPP)
	shell_fprintf(shell,
		      SHELL_INFO,
		      "sr_ant_switch_ctrl = %d\n",
		      conf_params->sr_ant_switch_ctrl);
#endif /* CONFIG_BOARD_NRF7002DK_NRF5340_CPUAPP_NRF7001 || CONFIG_BOARD_NRF7002DK_NRF5340_CPUAPP */

	shell_fprintf(shell,
		      SHELL_INFO,
		      "wlan_ant_switch_ctrl = %d\n",
		      conf_params->wlan_ant_switch_ctrl);
	shell_fprintf(shell,
		      SHELL_INFO,
		      "tx_pkt_cw = %d\n",
		      conf_params->tx_pkt_cw);

	shell_fprintf(shell,
		      SHELL_INFO,
		      "reg_domain = %c%c\n",
		      conf_params->country_code[0],
		      conf_params->country_code[1]);

